x = 1:1/100:2;
f = (x.^2)+x+(x.^(-1));


x2 = [1; 1.1; 1.2; 1.3; 1.4; 1.5; 1.6;1.7; 1.8; 1.9; 2];    
f2 = [3; 3.2; 3.44; 3.71463; 4.02026; 4.35436; 4.71511; 5.10116; 5.5115; 5.94536; 6.40212];

figure

plot(x,f,x2,f2,x2,f2,'ko'), grid
xlabel('Метод Эйлера')



%subplot(1,2,2)
%plot(t,z), grid

%figure
%subplot(1,1,1)
%plot(x,y), grid
%xlabel('Нелинейное уравнение')

%subplot(1,2,2)
%ezplot('x-cos(y)=1',[0,10]), hold
%ezplot('y-sin(x)=1',[0,10]), grid
%xlabel('Система нелинейных уравнений')

%ezplot('(x^2/9)-(y^2/(1.5^2))-1=0',[0,10]), hold
%ezplot('3*y-exp(x)-x=0',[0,10]), grid