x=0.05:0.05:0.95;
y = [0.5239;0.4963;0.4688;0.4412;0.4136;0.3860;0.3585;0.3309;0.3033;0.2757;0.2482;0.2206;0.1930;0.1654;0.1379;0.1103;0.0827;0.0551;0.0276];
  
plot(x,y,'g-',x,y,'ko'); 
grid on; 
title('Зависимость значения критериальной функции от весового коэффициента'); 
xlabel('gamma'); 
ylabel('u_*'); 


% x = 0:1/100:0.9;
% y = 0.732099*x+0.0870517*(x.^3);
% 
% t = 0.9:1/100:1.8;
% z = 0.72235+0.943635*(t-0.9)+0.23504*((t-0.9).^2)-0.275862*((t-0.9).^3);
% 
% l = 1.8:1/100:2.7;
% m = 1.5609+0.696361*(l-1.8)-0.509788*((l-1.8).^2)+1.46942*((l-1.8).^3);
% 
% h = 2.7:1/100:3.6;
% k=2.8459+2.49081*(h-2.7)+3.45763*((h-2.7).^2)-1.2806*((h-2.7).^3);
% 
% x1 = [0; 0.9; 1.8; 2.7; 3.6;];    
% f = [0; 0.72235; 1.5609; 2.8459; 7.0275];
% 
% %МНК
% s=-1:1/100:3.6;
% p1=-0.190129+2.24621*s;
% 
% p2=-0.464496+0.874367*s+0.508089*(s.^2);
% 
% x2 = [-0.9; 0; 0.9; 1.8; 2.7; 3.6;];    
% f2 = [-1.2689; 0; 1.2689; 2.6541; 4.4856; 9.9138];
% 
% figure
% 
% subplot(2,2,1)
% plot(x,y,t,z,l,m,h,k,x1,f,'ko'), grid
% xlabel('Кубический сплайн')
% 
% subplot(2,2,2)
% plot(t,z), grid
% xlabel('Кубический сплайн на отрезке [0.9;1.8]')
% 
% subplot(2,2,3)
% plot(s,p1,x2,f2,'--g',x2,f2,'ko'), grid
% xlabel('МНК: полином 1-й степени')
% 
% subplot(2,2,4)
% plot(s,p2,x2,f2,'--g',x2,f2,'ko'), grid
% xlabel('МНК: полином 2-й степени')
% 
% %subplot(1,2,2)
% %plot(t,z), grid
% 
% %figure
% %subplot(1,1,1)
% %plot(x,y), grid
% %xlabel('Нелинейное уравнение')
% 
% %subplot(1,2,2)
% %ezplot('x-cos(y)=1',[0,10]), hold
% %ezplot('y-sin(x)=1',[0,10]), grid
% %xlabel('Система нелинейных уравнений')
% 
% %ezplot('(x^2/9)-(y^2/(1.5^2))-1=0',[0,10]), hold
% %ezplot('3*y-exp(x)-x=0',[0,10]), grid