x = 0:1/100:0.9;
y = 0.732099*x+0.0870517*(x.^3);

t = 0.9:1/100:1.8;
z = 0.72235+0.943635*(t-0.9)+0.23504*((t-0.9).^2)-0.275862*((t-0.9).^3);

l = 1.8:1/100:2.7;
m = 1.5609+0.696361*(l-1.8)-0.509788*((l-1.8).^2)+1.46942*((l-1.8).^3);

h = 2.7:1/100:3.6;
k=2.8459+2.49081*(h-2.7)+3.45763*((h-2.7).^2)-1.2806*((h-2.7).^3);

figure
subplot(1,2,1)
plot(x,y,t,z,l,m,h,k), grid
xlabel('Кубический сплайн')
subplot(1,2,2)
plot(t,z), grid
xlabel('Кубический сплайн на отрезке [0.9;1.8]')

%subplot(1,2,2)
%plot(t,z), grid

%figure
%subplot(1,1,1)
%plot(x,y), grid
%xlabel('Нелинейное уравнение')

%subplot(1,2,2)
%ezplot('x-cos(y)=1',[0,10]), hold
%ezplot('y-sin(x)=1',[0,10]), grid
%xlabel('Система нелинейных уравнений')

%ezplot('(x^2/9)-(y^2/(1.5^2))-1=0',[0,10]), hold
%ezplot('3*y-exp(x)-x=0',[0,10]), grid